import { LOCALES } from "../locale";

const hy = {
  [LOCALES.Armenian]:{
    title: 'React Architecture. Ինչպես կառուցել և կազմակերպել React հավելվածը',
    desc: 'React հավելվածը կազմակերպելու ճիշտ ձևի վերաբերյալ կոնսենսուս չկա: React-ը ձեզ մեծ ազատություն է տալիս, բայց այդ ազատության հետ մեկտեղ գալիս է ձեր սեփական ճարտարապետությունը որոշելու պատասխանատվությունը: Հաճախ պատահում է, որ ով սկզբում տեղադրում է հավելվածը, գրեթե ամեն ինչ գցում է բաղադրիչների թղթապանակում, կամ գուցե բաղադրիչներն ու բեռնարկղերը, եթե նրանք օգտագործում էին Redux-ը, բայց ես առաջարկում եմ ավելի լավ տարբերակ: Ես սիրում եմ մտածված լինել, թե ինչպես եմ կազմակերպում իմ հավելվածները, որպեսզի դրանք հեշտ օգտագործվեն, հասկանան և ընդարձակվեն:',
    desc1: 'Ես պատրաստվում եմ ձեզ ցույց տալ, թե ինչ եմ համարում ինտուիտիվ և մասշտաբային համակարգ մեծածավալ արտադրության React հավելվածների համար: Հիմնական հայեցակարգը, որը, կարծում եմ, կարևոր է, որ ճարտարապետությունը կենտրոնանա հատկանիշի վրա՝ ի տարբերություն տիպի, կազմակերպելով միայն ընդհանուր բաղադրիչները գլոբալ մակարդակում և մոդուլյարացնելով բոլոր մյուս առնչվող սուբյեկտները՝ տեղայնացված տեսքով:'
  }
}
export default hy